
// тук създаваме променлива a и слагаме стойността и да е "apple"
var a = 'apple';
// тук създаваме променлива b и слагаме стойността и да е "watermellon"
var b = "watermellon";
// тук създаваме променлива c и слагаме стойността и да е "banana"
var c = "banana";

// тук добавяме думата "green " преди стойността на променлива a
a = "green "+a;
// тук добавяме думата "green " преди стойността на променлива b
b = "green "+b;
// тук добавяме думата "green " преди стойността на променлива c
c = "green "+c;


// за да не се налага да пишем едно и също нещо по няколко пъти се използва Масив от стойности.
// създаваме масив fruit
var fruit = Array();
// добавяме три различни индекса на масива с различни стойности
fruit['apple'] = 4;
fruit['banana'] = 8;
fruit['watm'] = 12;

// за всяка една съществуваща стойност на масива fruit 
for(index in fruit)
{

	//изпълняваме функцията sum която сумира две цифри и показва резултата
	// първата цифра е стойността от масива на която сме в момента (4/8/12) втората цифра е фиксираното число 4
	sum(fruit[index],4);

	
}

// създаване на променлива dog и задаване на стойността и да е 178
var dog=178;
// създаване на променлива cat и задаване на стойността и да е 3
var cat=3;

// подаваме cat и dog като параметри функция sum();, която ги сумира и дава резултат
sum(cat,dog);


function sum(a,b)
{
	c = a+b;
	alert(c);
}
// тестваме функция sum още няколко пъти
sum(1,3);
sum(5,12);
sum(4,12);


//създаваме ЕДНОМЕРЕН масив kasa;
var kasa = Array();

// като първа стойност (на нулева позиция) в масива записваме нов празен масив. 
// това ефективно ни прави kasa двумерен масив, а kasa[0] едномерен масив, който е стойност на първият индекс от kasa
kasa[0] = Array();
// попълваме първата стойност на подмасива с Becks [0][0]
kasa[0][0] = 'Becks';
// попълваме втората стойност на подмасива с Becks [0][1]
kasa[0][1] = 'Becks';
// попълваме втората стойност на подмасива с Kamenitza [0][2]
kasa[0][2] = 'Kamenitza';
kasa[0][3] = 'Becks';
kasa[0][4] = 'Becks';

// повтаряме за втори ред
kasa[1] = Array();
kasa[1][0] = 'Zagorka';
kasa[1][1] = 'Zagorka';
kasa[1][2] = 'Kamenitza';
kasa[1][3] = 'Zagorka';
kasa[1][4] = 'Zagorka';

// повтаряме за трети ред ред
kasa[2] = Array();
kasa[2][0] = 'Staropramen';
kasa[2][1] = 'Staropramen';
kasa[2][2] = 'Kamenitza';
kasa[2][3] = 'Staropramen';
kasa[2][4] = 'Staropramen';

// повтаряме за четврърти ред ред
kasa[3] = Array();
kasa[3][0] = 'Stolichno';
kasa[3][1] = 'Stolichno';
kasa[3][2] = 'Kamenitza';
kasa[3][3] = 'Stela Artois';
kasa[3][4] = 'Stela Artois';

// задаваме следното условие
// от 0 до дължината на масива kasa (състоящ се от 4 реда) увеличи брояча j++;
// при всяко минаване от тук j приема стойности в следния ред (0,1,2,3)
for(j=0; j<kasa.length;j++)
{
	
	// задаваме следното условие
	// от 0 до дължината на реда на който се намираме в момента(0,1,2,3) (състоящ се от 5 клетки) увеличи брояча i++;
	// при всяко минаване от тук j приема стойности в следния ред (0,1,2,3,4)
	for(i=0; i<kasa[j].length;i++ )
	{
		// покажи на кой ред и колона се намираме
		console.log("row:"+j);
		console.log("col:"+i);
		// изпълни функцията openBeer върху клетката на която се намираме
		openBeer(kasa[j][i]);
	}
}
// отвори бирата наречена Върбан
openBeer('Върбан');

// функция openBeer която приема един параметър.
function openBeer(beer)
{
	// и показва "otvorihme (име на подадената бира)"
	console.log('Otvorihme '+beer);
}

// слагаме променливата x=4
var x = 4;
// проверяваме Ако x>4
if(x > 4)
{
	// показваме "we are bigger"
	alert('we are bigger');
}
else // ако условието не е изпълнено
{
	// показваме грешката 
	alert('we are not')
}	

//Math.random() // функция даваща произволно число от 0 до 1;
//Math.floor() // функция вземаща основата на дробно число 231.63 ще бъде взето като 231

alert(Math.floor(Math.random()*48) + 1);

// създаваме масив в който да запишем изтеглените числа
var iztegleni = Array();


// Задача за домашна работа - създайте програма за теглене на тото 6/49

/* 
while()//дължината на изтеглените числа е <7 - изпълнявай тглене
{
	// изтегли число между 1 и 49;
	// провери дали числото е вече записано в изгеглени числа
	// ако числото не е записано - запиши го
	
}	

extension:

сложете изтегленото съдържание в определен DIV

// сложете 6 отделни див-а и ги изберете с document.getElementById 
//записвайки в първия първото число, във втория второто и т.н.




*/
